{
  "Next gen translation library": "Bibliothèque de traduction nouvelle génération",
  "It supports interpolation like so: {count}": "il prend en charge l'interpolation comme ceci: {count}",
  "Even with long paragraph statements that get formatted into multiple lines with tools like Prettier, react-dialect just works.": "Même avec de longs paragraphes formatés en plusieurs lignes avec des outils comme Prettier, le dialecte de réaction fonctionne tout simplement.",
  "Even better, long paragraph statements that get reformatted can still contain interpolated values like so: {count} and a second like so: {name} and still be parsed by react-dialect": "Mieux encore, les instructions de paragraphe long qui sont reformatées peuvent toujours contenir des valeurs interpolées comme ceci : {count} et une seconde comme ceci : {name} et toujours être analysées par React-Dialect.",
  "Sanity check for translations in multiple files": "Vérification de l'intégrité des traductions dans plusieurs fichiers",
  "React dialect can even replace the same value interpolated multiple times in a string. As an example, the count is {count}, {count} and {count}.": "React-Dialect peut même remplacer la même valeur interpolée plusieurs fois dans une chaîne. À titre d'exemple, le nombre est {count}, {count} et {count}.",
  "The translate function from the hook can even be destructured as an alias and it still works even with interpolated values like {name} and {count}. Just be prepared for long translation keys": "La fonction de traduction du hook peut même être déstructurée en tant qu'alias et elle fonctionne toujours même avec des valeurs interpolées telles que {name} et {count}. Préparez-vous simplement aux longues clés de traduction",
  "Use the translate function for side-effects": "Utilisez la fonction de traduction pour les effets secondaires",
  "The translate function from the hook can be destructured and it still works": "La fonction de traduction du hook peut être déstructurée et elle fonctionne toujours"
}
